<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a4034e4f310a24d43b3c2fd275e3a2dcc442143a127db7e351ef0327139b2d49","plan_job_ref":"Job Terraform Plan #727 at https://github.com/cal-itp/data-infra/actions/runs/20177368173","plan_out_hash":"40ea89fa54023777ab9aede581e3d4a0e424f1e7fd16e9b64f78af178a345d72","plan_hash":"3d160a01c86b58a9a740efe7bae0645e4611a94d1fa87a4d385763471cc96f39","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/cdn/us__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_compute_managed_ssl_certificate.calitp-staging must be replaced
+/- resource "google_compute_managed_ssl_certificate" "calitp-staging" {
!~      certificate_id            = 2351820504053552947 -> (known after apply)
!~      creation_timestamp        = "2025-12-10T18:18:04.450-08:00" -> (known after apply)
+       expire_time               = (known after apply)
!~      id                        = "***************************************************************************************" -> (known after apply)
!~      name                      = "calitp-staging-certificate-2" -> "calitp-staging-certificate-3" # forces replacement
!~      self_link                 = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra-staging/global/sslCertificates/calitp-staging-certificate-2" -> (known after apply)
!~      subject_alternative_names = [] -> (known after apply)
#        (3 unchanged attributes hidden)

!~      managed {
!~          domains = [ # forces replacement
!~              "dbt-docs-staging.dds.dot.ca.gov" -> "dbt-docs-staging.dds.dot.ca.gov.",
!~              "staging-reports.dds.dot.ca.gov" -> "reports-staging.dds.dot.ca.gov.",
            ]
        }
    }

  # google_compute_target_https_proxy.calitp-staging-https will be updated in-place
!~  resource "google_compute_target_https_proxy" "calitp-staging-https" {
        id                               = "projects/cal-itp-data-infra-staging/global/targetHttpsProxies/calitp-staging-https-proxy"
        name                             = "calitp-staging-https-proxy"
!~      ssl_certificates                 = [
-           "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra-staging/global/sslCertificates/calitp-staging-certificate-2",
        ] -> (known after apply)
#        (15 unchanged attributes hidden)
    }

  # google_compute_url_map.calitp-staging-https will be updated in-place
!~  resource "google_compute_url_map" "calitp-staging-https" {
        id                 = "projects/cal-itp-data-infra-staging/global/urlMaps/calitp-staging-https-load-balancer"
        name               = "calitp-staging-https-load-balancer"
#        (7 unchanged attributes hidden)

-       host_rule {
-           hosts        = [
-               "dbt-docs-staging.dds.dot.ca.gov",
            ] -> null
-           path_matcher = "dbt-docs" -> null
#            (1 unchanged attribute hidden)
        }
-       host_rule {
-           hosts        = [
-               "staging-reports.dds.dot.ca.gov",
            ] -> null
-           path_matcher = "staging-reports" -> null
#            (1 unchanged attribute hidden)
        }
+       host_rule {
+           hosts        = [
+               "reports-staging.dds.dot.ca.gov",
            ]
+           path_matcher = "reports-staging"
#            (1 unchanged attribute hidden)
        }
+       host_rule {
+           hosts        = [
+               "dbt-docs-staging.dds.dot.ca.gov",
            ]
+           path_matcher = "dbt-docs"
        }

!~      path_matcher {
!~          name            = "staging-reports" -> "reports-staging"
#            (2 unchanged attributes hidden)

#            (1 unchanged block hidden)
        }

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #727](https://github.com/cal-itp/data-infra/actions/runs/20177368173)